# Slicing

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

### 1. Series에서 slicing

In [3]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [4]:
obj['b':'c']

b    1
c    2
dtype: int64

In [5]:
obj['b':'c'] = 10
obj

a     0
b    10
c    10
d     3
dtype: int64

### 2. DataFrame에서 slicing

In [6]:
data  = DataFrame(np.arange(16).reshape(4,4),
                 index=['seoul', 'busan', 'gwangju', 'daegu'],
                 columns=['one', 'two', 'three', 'four'])
data

         one  two  three  four
seoul      0    1      2     3
busan      4    5      6     7
gwangju    8    9     10    11
daegu     12   13     14    15

In [7]:
data['two']

seoul       1
busan       5
gwangju     9
daegu      13
Name: two, dtype: int64

In [8]:
data[['two', 'three']]

         two  three
seoul      1      2
busan      5      6
gwangju    9     10
daegu     13     14

In [9]:
data[:2]

       one  two  three  four
seoul    0    1      2     3
busan    4    5      6     7

In [10]:
data[data['three']>7]

         one  two  three  four
gwangju    8    9     10    11
daegu     12   13     14    15

In [11]:
data < 5

           one    two  three   four
seoul     True   True   True   True
busan     True  False  False  False
gwangju  False  False  False  False
daegu    False  False  False  False

In [12]:
data[data<5] = 0
data

         one  two  three  four
seoul      0    0      0     0
busan      0    5      6     7
gwangju    8    9     10    11
daegu     12   13     14    15

- ix 속성: DataFrame의 특수한 색인 필드(속성)

In [15]:
data.ix['seoul']

one      0
two      0
three    0
four     0
Name: seoul, dtype: int64

In [16]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: gwangju, dtype: int64

In [17]:
data.ix[2,3]

11

In [18]:
data.ix['busan', ['two', 'three']]

two      5
three    6
Name: busan, dtype: int64

In [19]:
data.ix[['gwangju', 'daegu'], ['three', 'four']]

         three  four
gwangju     10    11
daegu       14    15

In [20]:
data.ix[['seoul', 'daegu'], ['three', 'one']]

       three  one
seoul      0    0
daegu     14   12

In [21]:
data.ix[['daegu', 'gwangju'], [3, 0, 1]]

         four  one  two
daegu      15   12   13
gwangju    11    8    9

In [37]:
data.ix[:'gwangju', 'three']

seoul       0
busan       6
gwangju    10
Name: three, dtype: int64

In [22]:
data.ix[data['three'] > 5, :3]

         one  two  three
busan      0    5      6
gwangju    8    9     10
daegu     12   13     14